config/cf/InformationRegisters/ВыполнениеПравилСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеПравилСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальности</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСобытияЖурналаПравилВыполнения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияПравилСобытий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СозданныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/ВыполнениеПравилСобытий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗафиксироватьВыполнениеПравила(Знач Правило, Знач СозданныйОбъект, Знач Действие,
	Знач ДатаВыполнения = Неопределено, Знач Результат = "", Знач ТипСобытия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ВыполнениеПравилСобытий.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Правило				= Правило;
	МенеджерЗаписи.СозданныйОбъект		= СозданныйОбъект;
	МенеджерЗаписи.Действие				= Действие;
	Если ДатаВыполнения = Неопределено Тогда
		МенеджерЗаписи.ДатаВыполнения	= ТекущаяДатаСеанса();
	Иначе
		МенеджерЗаписи.ДатаВыполнения	= ДатаВыполнения;
	КонецЕсли;	
	МенеджерЗаписи.Результат			= Результат;
	МенеджерЗаписи.КлючУникальности		= Новый УникальныйИдентификатор;
	Если ЗначениеЗаполнено(ТипСобытия) Тогда
		МенеджерЗаписи.ТипСобытия 		= ТипСобытия;
	КонецЕсли;	
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
